dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l47x_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L47x_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L47x_PINMUX_H_)
# define _STM32L47x_PINMUX_H_

#define CAN1_RX_FUNC             0
#define CAN1_TX_FUNC             1
#define COMP1_OUT_FUNC           2
#define COMP2_OUT_FUNC           3
#define DFSDM1_CKIN0_FUNC        4
#define DFSDM1_CKIN1_FUNC        5
#define DFSDM1_CKIN2_FUNC        6
#define DFSDM1_CKIN3_FUNC        7
#define DFSDM1_CKIN4_FUNC        8
#define DFSDM1_CKIN5_FUNC        9
#define DFSDM1_CKIN6_FUNC        10
#define DFSDM1_CKIN7_FUNC        11
#define DFSDM1_CKOUT_FUNC        12
#define DFSDM1_DATIN0_FUNC       13
#define DFSDM1_DATIN1_FUNC       14
#define DFSDM1_DATIN2_FUNC       15
#define DFSDM1_DATIN3_FUNC       16
#define DFSDM1_DATIN4_FUNC       17
#define DFSDM1_DATIN5_FUNC       18
#define DFSDM1_DATIN6_FUNC       19
#define DFSDM1_DATIN7_FUNC       20
#define EVENTOUT_FUNC            21
#define FMC_A0_FUNC              22
#define FMC_A1_FUNC              23
#define FMC_A10_FUNC             24
#define FMC_A11_FUNC             25
#define FMC_A12_FUNC             26
#define FMC_A13_FUNC             27
#define FMC_A14_FUNC             28
#define FMC_A15_FUNC             29
#define FMC_A16_FUNC             30
#define FMC_A17_FUNC             31
#define FMC_A18_FUNC             32
#define FMC_A19_FUNC             33
#define FMC_A2_FUNC              34
#define FMC_A20_FUNC             35
#define FMC_A21_FUNC             36
#define FMC_A22_FUNC             37
#define FMC_A23_FUNC             38
#define FMC_A24_FUNC             39
#define FMC_A25_FUNC             40
#define FMC_A3_FUNC              41
#define FMC_A4_FUNC              42
#define FMC_A5_FUNC              43
#define FMC_A6_FUNC              44
#define FMC_A7_FUNC              45
#define FMC_A8_FUNC              46
#define FMC_A9_FUNC              47
#define FMC_CLK_FUNC             48
#define FMC_D0_FUNC              49
#define FMC_D1_FUNC              50
#define FMC_D10_FUNC             51
#define FMC_D11_FUNC             52
#define FMC_D12_FUNC             53
#define FMC_D13_FUNC             54
#define FMC_D14_FUNC             55
#define FMC_D15_FUNC             56
#define FMC_D2_FUNC              57
#define FMC_D3_FUNC              58
#define FMC_D4_FUNC              59
#define FMC_D5_FUNC              60
#define FMC_D6_FUNC              61
#define FMC_D7_FUNC              62
#define FMC_D8_FUNC              63
#define FMC_D9_FUNC              64
#define FMC_DA0_FUNC             65
#define FMC_DA1_FUNC             66
#define FMC_DA10_FUNC            67
#define FMC_DA11_FUNC            68
#define FMC_DA12_FUNC            69
#define FMC_DA13_FUNC            70
#define FMC_DA14_FUNC            71
#define FMC_DA15_FUNC            72
#define FMC_DA2_FUNC             73
#define FMC_DA3_FUNC             74
#define FMC_DA4_FUNC             75
#define FMC_DA5_FUNC             76
#define FMC_DA6_FUNC             77
#define FMC_DA7_FUNC             78
#define FMC_DA8_FUNC             79
#define FMC_DA9_FUNC             80
#define FMC_INT3_FUNC            81
#define FMC_NBL0_FUNC            82
#define FMC_NBL1_FUNC            83
#define FMC_NCE3_FUNC            84
#define FMC_NE1_FUNC             85
#define FMC_NE2_FUNC             86
#define FMC_NE3_FUNC             87
#define FMC_NE4_FUNC             88
#define FMC_NL_FUNC              89
#define FMC_NOE_FUNC             90
#define FMC_NWAIT_FUNC           91
#define FMC_NWE_FUNC             92
#define I2C1_SCL_FUNC            93
#define I2C1_SDA_FUNC            94
#define I2C1_SMBA_FUNC           95
#define I2C2_SCL_FUNC            96
#define I2C2_SDA_FUNC            97
#define I2C2_SMBA_FUNC           98
#define I2C3_SCL_FUNC            99
#define I2C3_SDA_FUNC            100
#define I2C3_SMBA_FUNC           101
#define IR_OUT_FUNC              102
#define LCD_COM0_FUNC            103
#define LCD_COM1_FUNC            104
#define LCD_COM2_FUNC            105
#define LCD_COM3_FUNC            106
#define LCD_COM4_FUNC            107
#define LCD_COM5_FUNC            108
#define LCD_COM6_FUNC            109
#define LCD_COM7_FUNC            110
#define LCD_SEG0_FUNC            111
#define LCD_SEG1_FUNC            112
#define LCD_SEG10_FUNC           113
#define LCD_SEG11_FUNC           114
#define LCD_SEG12_FUNC           115
#define LCD_SEG13_FUNC           116
#define LCD_SEG14_FUNC           117
#define LCD_SEG15_FUNC           118
#define LCD_SEG16_FUNC           119
#define LCD_SEG17_FUNC           120
#define LCD_SEG18_FUNC           121
#define LCD_SEG19_FUNC           122
#define LCD_SEG2_FUNC            123
#define LCD_SEG20_FUNC           124
#define LCD_SEG21_FUNC           125
#define LCD_SEG22_FUNC           126
#define LCD_SEG23_FUNC           127
#define LCD_SEG24_FUNC           128
#define LCD_SEG25_FUNC           129
#define LCD_SEG26_FUNC           130
#define LCD_SEG27_FUNC           131
#define LCD_SEG28_FUNC           132
#define LCD_SEG29_FUNC           133
#define LCD_SEG3_FUNC            134
#define LCD_SEG30_FUNC           135
#define LCD_SEG31_FUNC           136
#define LCD_SEG32_FUNC           137
#define LCD_SEG33_FUNC           138
#define LCD_SEG34_FUNC           139
#define LCD_SEG35_FUNC           140
#define LCD_SEG36_FUNC           141
#define LCD_SEG37_FUNC           142
#define LCD_SEG38_FUNC           143
#define LCD_SEG39_FUNC           144
#define LCD_SEG4_FUNC            145
#define LCD_SEG40_FUNC           146
#define LCD_SEG41_FUNC           147
#define LCD_SEG42_FUNC           148
#define LCD_SEG43_FUNC           149
#define LCD_SEG5_FUNC            150
#define LCD_SEG6_FUNC            151
#define LCD_SEG7_FUNC            152
#define LCD_SEG8_FUNC            153
#define LCD_SEG9_FUNC            154
#define LCD_VLCD_FUNC            155
#define LPTIM1_ETR_FUNC          156
#define LPTIM1_IN1_FUNC          157
#define LPTIM1_IN2_FUNC          158
#define LPTIM1_OUT_FUNC          159
#define LPTIM2_ETR_FUNC          160
#define LPTIM2_IN1_FUNC          161
#define LPTIM2_OUT_FUNC          162
#define LPUART1_CTS_FUNC         163
#define LPUART1_DE_FUNC          164
#define LPUART1_RTS_FUNC         165
#define LPUART1_RX_FUNC          166
#define LPUART1_TX_FUNC          167
#define QUADSPI_BK1_IO0_FUNC     168
#define QUADSPI_BK1_IO1_FUNC     169
#define QUADSPI_BK1_IO2_FUNC     170
#define QUADSPI_BK1_IO3_FUNC     171
#define QUADSPI_CLK_FUNC         172
#define QUADSPI_NCS_FUNC         173
#define RCC_MCO_FUNC             174
#define RTC_OUT_ALARM_FUNC       175
#define RTC_OUT_CALIB_FUNC       176
#define RTC_REFIN_FUNC           177
#define SAI1_EXTCLK_FUNC         178
#define SAI1_FS_A_FUNC           179
#define SAI1_FS_B_FUNC           180
#define SAI1_MCLK_A_FUNC         181
#define SAI1_MCLK_B_FUNC         182
#define SAI1_SCK_A_FUNC          183
#define SAI1_SCK_B_FUNC          184
#define SAI1_SD_A_FUNC           185
#define SAI1_SD_B_FUNC           186
#define SAI2_EXTCLK_FUNC         187
#define SAI2_FS_A_FUNC           188
#define SAI2_FS_B_FUNC           189
#define SAI2_MCLK_A_FUNC         190
#define SAI2_MCLK_B_FUNC         191
#define SAI2_SCK_A_FUNC          192
#define SAI2_SCK_B_FUNC          193
#define SAI2_SD_A_FUNC           194
#define SAI2_SD_B_FUNC           195
#define SDMMC1_CK_FUNC           196
#define SDMMC1_CMD_FUNC          197
#define SDMMC1_D0_FUNC           198
#define SDMMC1_D1_FUNC           199
#define SDMMC1_D2_FUNC           200
#define SDMMC1_D3_FUNC           201
#define SDMMC1_D4_FUNC           202
#define SDMMC1_D5_FUNC           203
#define SDMMC1_D6_FUNC           204
#define SDMMC1_D7_FUNC           205
#define SPI1_MISO_FUNC           206
#define SPI1_MOSI_FUNC           207
#define SPI1_NSS_FUNC            208
#define SPI1_SCK_FUNC            209
#define SPI2_MISO_FUNC           210
#define SPI2_MOSI_FUNC           211
#define SPI2_NSS_FUNC            212
#define SPI2_SCK_FUNC            213
#define SPI3_MISO_FUNC           214
#define SPI3_MOSI_FUNC           215
#define SPI3_NSS_FUNC            216
#define SPI3_SCK_FUNC            217
#define SWPMI1_IO_FUNC           218
#define SWPMI1_RX_FUNC           219
#define SWPMI1_SUSPEND_FUNC      220
#define SWPMI1_TX_FUNC           221
#define SYS_JTCK_SWCLK_FUNC      222
#define SYS_JTDI_FUNC            223
#define SYS_JTDO_SWO_FUNC        224
#define SYS_JTMS_SWDIO_FUNC      225
#define SYS_JTRST_FUNC           226
#define SYS_TRACECLK_FUNC        227
#define SYS_TRACED0_FUNC         228
#define SYS_TRACED1_FUNC         229
#define SYS_TRACED2_FUNC         230
#define SYS_TRACED3_FUNC         231
#define TIM15_BKIN_FUNC          232
#define TIM15_CH1_FUNC           233
#define TIM15_CH1N_FUNC          234
#define TIM15_CH2_FUNC           235
#define TIM16_BKIN_FUNC          236
#define TIM16_CH1_FUNC           237
#define TIM16_CH1N_FUNC          238
#define TIM17_BKIN_FUNC          239
#define TIM17_CH1_FUNC           240
#define TIM17_CH1N_FUNC          241
#define TIM1_BKIN_FUNC           242
#define TIM1_BKIN2_FUNC          243
#define TIM1_BKIN2_COMP1_FUNC    244
#define TIM1_BKIN2_COMP2_FUNC    245
#define TIM1_BKIN_COMP1_FUNC     246
#define TIM1_BKIN_COMP2_FUNC     247
#define TIM1_CH1_FUNC            248
#define TIM1_CH1N_FUNC           249
#define TIM1_CH2_FUNC            250
#define TIM1_CH2N_FUNC           251
#define TIM1_CH3_FUNC            252
#define TIM1_CH3N_FUNC           253
#define TIM1_CH4_FUNC            254
#define TIM1_ETR_FUNC            255
#define TIM2_CH1_FUNC            256
#define TIM2_CH2_FUNC            257
#define TIM2_CH3_FUNC            258
#define TIM2_CH4_FUNC            259
#define TIM2_ETR_FUNC            260
#define TIM3_CH1_FUNC            261
#define TIM3_CH2_FUNC            262
#define TIM3_CH3_FUNC            263
#define TIM3_CH4_FUNC            264
#define TIM3_ETR_FUNC            265
#define TIM4_CH1_FUNC            266
#define TIM4_CH2_FUNC            267
#define TIM4_CH3_FUNC            268
#define TIM4_CH4_FUNC            269
#define TIM4_ETR_FUNC            270
#define TIM5_CH1_FUNC            271
#define TIM5_CH2_FUNC            272
#define TIM5_CH3_FUNC            273
#define TIM5_CH4_FUNC            274
#define TIM5_ETR_FUNC            275
#define TIM8_BKIN_FUNC           276
#define TIM8_BKIN2_FUNC          277
#define TIM8_BKIN2_COMP1_FUNC    278
#define TIM8_BKIN2_COMP2_FUNC    279
#define TIM8_BKIN_COMP1_FUNC     280
#define TIM8_BKIN_COMP2_FUNC     281
#define TIM8_CH1_FUNC            282
#define TIM8_CH1N_FUNC           283
#define TIM8_CH2_FUNC            284
#define TIM8_CH2N_FUNC           285
#define TIM8_CH3_FUNC            286
#define TIM8_CH3N_FUNC           287
#define TIM8_CH4_FUNC            288
#define TIM8_ETR_FUNC            289
#define TSC_G1_IO1_FUNC          290
#define TSC_G1_IO2_FUNC          291
#define TSC_G1_IO3_FUNC          292
#define TSC_G1_IO4_FUNC          293
#define TSC_G2_IO1_FUNC          294
#define TSC_G2_IO2_FUNC          295
#define TSC_G2_IO3_FUNC          296
#define TSC_G2_IO4_FUNC          297
#define TSC_G3_IO1_FUNC          298
#define TSC_G3_IO2_FUNC          299
#define TSC_G3_IO3_FUNC          300
#define TSC_G3_IO4_FUNC          301
#define TSC_G4_IO1_FUNC          302
#define TSC_G4_IO2_FUNC          303
#define TSC_G4_IO3_FUNC          304
#define TSC_G4_IO4_FUNC          305
#define TSC_G5_IO1_FUNC          306
#define TSC_G5_IO2_FUNC          307
#define TSC_G5_IO3_FUNC          308
#define TSC_G5_IO4_FUNC          309
#define TSC_G6_IO1_FUNC          310
#define TSC_G6_IO2_FUNC          311
#define TSC_G6_IO3_FUNC          312
#define TSC_G6_IO4_FUNC          313
#define TSC_G7_IO1_FUNC          314
#define TSC_G7_IO2_FUNC          315
#define TSC_G7_IO3_FUNC          316
#define TSC_G7_IO4_FUNC          317
#define TSC_G8_IO1_FUNC          318
#define TSC_G8_IO2_FUNC          319
#define TSC_G8_IO3_FUNC          320
#define TSC_G8_IO4_FUNC          321
#define TSC_SYNC_FUNC            322
#define UART4_CTS_FUNC           323
#define UART4_DE_FUNC            324
#define UART4_RTS_FUNC           325
#define UART4_RX_FUNC            326
#define UART4_TX_FUNC            327
#define UART5_CTS_FUNC           328
#define UART5_DE_FUNC            329
#define UART5_RTS_FUNC           330
#define UART5_RX_FUNC            331
#define UART5_TX_FUNC            332
#define USART1_CK_FUNC           333
#define UART1_CK_FUNC            333
#define USART1_CTS_FUNC          334
#define UART1_CTS_FUNC           334
#define USART1_DE_FUNC           335
#define UART1_DE_FUNC            335
#define USART1_RTS_FUNC          336
#define UART1_RTS_FUNC           336
#define USART1_RX_FUNC           337
#define UART1_RX_FUNC            337
#define USART1_TX_FUNC           338
#define UART1_TX_FUNC            338
#define USART2_CK_FUNC           339
#define UART2_CK_FUNC            339
#define USART2_CTS_FUNC          340
#define UART2_CTS_FUNC           340
#define USART2_DE_FUNC           341
#define UART2_DE_FUNC            341
#define USART2_RTS_FUNC          342
#define UART2_RTS_FUNC           342
#define USART2_RX_FUNC           343
#define UART2_RX_FUNC            343
#define USART2_TX_FUNC           344
#define UART2_TX_FUNC            344
#define USART3_CK_FUNC           345
#define UART3_CK_FUNC            345
#define USART3_CTS_FUNC          346
#define UART3_CTS_FUNC           346
#define USART3_DE_FUNC           347
#define UART3_DE_FUNC            347
#define USART3_RTS_FUNC          348
#define UART3_RTS_FUNC           348
#define USART3_RX_FUNC           349
#define UART3_RX_FUNC            349
#define USART3_TX_FUNC           350
#define UART3_TX_FUNC            350
#define USB_OTG_FS_DM_FUNC       351
#define USB_OTG_FS_DP_FUNC       352
#define USB_OTG_FS_ID_FUNC       353
#define USB_OTG_FS_NOE_FUNC      354
#define USB_OTG_FS_SOF_FUNC      355

